[{
        "name": "Abby Mclaughlin",
        "about": "Abby is a graduate of Columbia University and a first-year PhD student studying Psychology at Boston College. She earned her BA in Neuroscience and Behavior in 2020 and graduated with honors in Neuroscience. While at Columbia, Abby was a member of the Division 1 Track and Cross Country teams, worked as an editor for The Columbia Review, and was an undergraduate researcher in the Social and Moral Cognition Lab. She now works in the Cooperation Lab at Boston College, where her research focuses on the development of children’s prosocial behavior and belief systems.##Abby began tutoring as a member of the National Honor Society in high school, and worked as a biology and study skills tutor in the Center for Student Advising at Columbia. This experience helped her to realize her passion for teaching and mentoring, and contributed to her decision to pursue a PhD. At Boston College, Abby has worked as a teaching assistant for psychology and neuroscience courses, which has allowed her to work closely with students and share her love of science. She is motivated to make science and math accessible to her students and to encourage students to be creative problem-solvers.",
        "satact": "2170,35",
        "subjects": "Pre-calc, Algebra I, Algebra II, College Application",
        "school": "Columbia",
        "location": "New York",
        "ap5": "Calculus AB",
        "role": "Tutor"
    },
    {
        "name": "Adam Johnson",
        "about": "Adam is a first-year Biomedical Engineering student at Duke University. Originally from West Palm Beach, FL, Adam is not only passionate about the biomedical sciences, but also environmental activism. As a trumpet player of 10 years, Adam is a member of the Duke University Wind Symphony, and Duke’s Baldwin Brass Quintet. He is currently a member of Duke Student Broadcasting, Duke University Union, the Green Devil Sustainability Ambassador Certification Program, and a Bass Connections research team focused on innovative engineering design in Energy and the Environment.##He scored a 36 on the ACT on his first attempt, and is excited to help students not only succeed in subjects they’re struggling with, but gain an interest and passion for the act of learning itself. He began tutoring in high school as the head science tutor for Dreyfoos School of the Arts’ National Honor Society tutoring program, where he tutored the SAT, ACT, and AP science subjects. He loves getting to know motivated students, and assisting them in achieving their academic goals.",
        "satact": "1570,36",
        "subjects": "Biology, Chemistry, Economics, US History, World History, English Lang, English Lit, Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra",
        "school": "Duke",
        "location": "Durham",
        "ap5": "Biology,Calculus AB,Calculus BC,Chemistry,English Language and Composition,Human Geography,Macroeconomics,US History,World History",
        "role": "Tutor"
    },
    {
        "name": "Alixandra Rubin",
        "about": "Alix is a first-year Mechanical Engineering major at Georgia Tech. Originally from Tampa, FL, Alix is involved in many organizations on campus, including Engineers Without Borders, Yellow Jacket Club, and Georgia Tech Swim Club. Alix is also beginning research in an AquaBots lab in the fall.##Alix has tutored her peers and younger students throughout high school in a variety of subjects. She loves helping kids and seeing them thrive both in and out of the classroom!",
        "satact": "0,35",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Computer Science, Physics, Biology, Economics, US History, World History, Art, English Lit",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Art History,Biology,Calculus AB,Caluclus BC,Computer Science Principles,English Literature and Composition,Macroeconomics,Psychology,US Government & Politics,US History,World History",
        "role": "Tutor"
    },
    {
        "name": "Ameera Patel",
        "about": "Ameera is a Biomedical Engineering Major at Georgia Tech. She is the Vice-President of After School Activities for Junior STEM, an outreach program for underprivileged students in Atlanta. She also is part of the Biomedical Engineering Robotics team where she and a group of fellow students are constructing a low-cost prosthetic limb for the developing world.##Having grown up in Arizona, she loves to spend her free time exploring Atlanta, trying new restaurants, and seeing all that the city has to offer. Since her time as a tutor in high school, her favorite part of it all is getting to see all the creative ways that different students approach the same problem.",
        "satact": "1540,33",
        "subjects": "Economics, English Lit, English Lang",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Macroeconomics,English Language and Composition,Psychology,Human Geography",
        "role": "Tutor"
    },
    {
        "name": "Anna Gumberg",
        "about": "Anna is a third year double majoring in physics and philosophy at Yale University. She is co-captain of the Yale Moot Court team, and plays clarinet in the Davenport Pops Orchestra. She is also a stage manager at the Yale School of Music and an enthusiastic participant in intramural corn hole!##Anna has been teaching since she started high school and enjoys working with students on test prep as well as on writing, math, and physics.",
        "satact": "0,35",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, English Lang, English Lit, US History, World History",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "Calculus AB,Calculus BC,English Language and Composition,US History,World History",
        "role": "Tutor"
    },
    {
        "name": "Aradhya Rajanala",
        "about": "Aradhya is a PhD student studying Quantitative Biosciences at Georgia Tech. Originally from New Jersey, Aradhya is an avid musician, playing both violin and guitar. He also enjoys reading and learning more about various subjects, including math and computer science.##Aradhya has been teaching SAT and ACT for more than four years and is the director of Alexander Academy’s yearly Math for College Workshop at Georgia Tech. He has also taught various high school subjects including chemistry, physics, and calculus. Aradhya finds teaching like a puzzle, finding new perspectives to better explain concepts. He enjoys seeing students quickly improve after they learn a new way to solve a problem.",
        "satact": "1560,0",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, English Lang, English Lit, Computer Science, Physics, US History",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Calculus AB,Calculus BC,English Language and Composition,Computer Science A,U.S. History,Physics 1: Algebra-Based,Physics C: Electricity & Magnetism,Physics C: Mechanics",
        "role": "Tutor"
    },
    {
        "name": "Audrey Johnson",
        "about": "Audrey is a 3rd year Industrial and Systems Engineering Major at Georgia Tech. She is a leader in her sorority, Alpha Gamma Delta, and is involved in several service organizations on campus. Audrey recently accepted an engineering Co-op position with Delta Airlines, and plans to pursue a career in the travel industry after graduation.##Audrey began tutoring in high school, and has worked with students of all ages in both academic subjects and ACT prep. She prides herself in creating a comfortable space for her students to learn and grow, and she is honored to work with such motivated and eager students. Her favorite thing about teaching is witnessing the growth a student shows from beginning to end, and reinforcing to each student just how capable of greatness they are.",
        "satact": "0,35",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, English Lang, English Lit, Economics, US History, World History",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Calculus AB,Caluclus BC,English Literature and Composition,Macroeconomics,US Government & Politics,US History,World History",
        "role": "Tutor"
    },
    {
        "name": "Caitlin Chun",
        "about": "Caitlin is a 3rd year Global Affairs major at Yale University. On-campus, she is the president of YaleDancers, Yale's oldest student-run dance organization. She is also involved in Yale's Elmseed Enterprise Fund, a non-profit aimed at providing consulting services and funding for New Haven entrepreneurs and startups. Beyond that, she is also a research assistant at both the Yale School of Management and Yale's School of Public Health.##Caitlin started tutoring in high school through a program called the California Scholarship Federation, in which Caitlin frequently tutored underclassmen in science and math. Furthermore, after completing her own college applications, Caitlin joined Collegevine as an essay consultant, editing student essays for both content and grammar, helping position applicants for success. Her favorite part of tutoring is interacting with students and aiding their learning process.",
        "satact": "1580,35",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Physics, Biology, Art, Chemistry, English Lang, English Lit",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "Art History,Biology,Calculus AB,Calculus BC,Chemistry,English Language and Composition,Macroeconomics,Physics 1: Algebra-Based,U.S. History,World History",
        "role": "Tutor"
    },
    {
        "name": "Carter Martindale",
        "about": "Carter is a Junior at Harvard College majoring in Government with a minor in Russian studies. Outside of class he helps run the governing board for Harvard Model Congress, mentors for the Urban Debate League, and provides free legal information to residents of Massachusetts as a volunteer for the Small Claims Advisory Service. After graduation, Carter is planning on attending Law School and working in public service law.##Teaching has been an important part of Carter’s life since highschool where he tutored peers in Physics and participated in a program that taught English in Ukraine and Moldova to native Russian speakers. In College, he has continued to mentor high school students across all core subjects, and is teaching whenever he can find the time. He can't wait to meet his next Alexander Academy student!",
        "satact": "0,35",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, English Lang",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Calculus AB,English Language and Composition,US Government & Politics",
        "role": "Tutor"
    },
    {
        "name": "Clay Oxford",
        "about": "Originally from Raleigh, N.C., Clay is a college dropout with plans to be the next Mark Zuckerberg, but like nicer? If (read: when) those plans don’t work out, he’ll be returning to Harvard as a junior concentrating in Government, with secondaries in Economics and Philosophy.  At school, he has researched decision-making in the U.S. National Security Council, served in editing and management roles for the Harvard Political Review, and music directed a mainstage production of Mamma Mia!##In addition to his work with Alexander Academy, Clay has tutored fellow students in economics at Harvard, and served as an editor during his time with the HPR. Clay enjoys helping students find new ways to solve problems and express themselves through writing.",
        "satact": "1560,36",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Economics, Statistics, US History, World History, College Application",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Calculus AB,Calculus BC,Environmental Science,Statistics,U.S. History,World History",
        "role": "Tutor"
    },
    {
        "name": "Elmira Hezarkhani",
        "about": "Elmira is a 3rd year undergraduate at Duke University majoring in Neuroscience and minoring in Music. She serves as the President of Happy Kids Healthy Kids and is a research assistant in the Department of Neurobiology and Population Health Sciences. After graduating, she intends on attending dental school and pursuing a master’s degree in public health.##Elmira tutored throughout high school, working at various learning centers with students ages 5-18. She has also worked with children of various ages teaching taekwondo. She enjoys working with all students to find clear, individualized explanations.",
        "satact": "0,34",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Spanish, Statistics, US History",
        "school": "Duke",
        "location": "Durham",
        "ap5": "Calculus BC,Human Geography,Spanish Language & Culture,Statistics,US History",
        "role": "Tutor"
    },
    {
        "name": "Ethan Dong",
        "about": "Ethan is a Mechanical Engineering and Computer Science major at Yale University. Originally from Madison, Wisconsin, he enjoys swimming, learning to solve different Rubik’s Cubes, and listening to Taylor Swift. In high school, he was a robotics fanatic, President of a local FIRST Robotics Competition team, and one of 161 U.S. Presidential Scholars across the nation. Now at Yale, Ethan is Treasurer and a mentor in Code Haven, an organization that helps introduce computer science to middle school students.##Prior to joining Alexander Academy, Ethan  tutored students in numerous high school courses, ACT/SAT exams, and AP tests through a peer mentorship program in high school, and with a non-profit organization. He loves being able to help other students overcome some of the barriers associated with these tests and classes so that everyone can take steps towards their own academic success and enjoy learning a little bit more!",
        "satact": "1570,36",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Statistics, Computer Science, Physics, Chemistry, Economics, Chinese",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "Calculus AB,Calculus BC,Chemistry,Chinese Language & Culture,Computer Science A,Microeconomics,Physics 1: Algebra-Based,Physics 2: Algebra-Based,Statistics",
        "role": "Tutor"
    },
    {
        "name": "Frank Malone",
        "about": "Aidan is a 2nd year Electrical Engineering Major at Georgia Tech and a member of the Naval Reserve Officer Training Corps. After graduating, Aidan hopes to receive a commission as a Naval Aviator.##As a high schooler, Aidan loved working with his peers and younger siblings to broaden their understanding of a variety of STEM topics, notably math and physics. In college, Aidan acts as a mentor to his students and midshipmen, helping them pursue their full academic and character potential. He is also a passionate investor, biker, and mountaineer!",
        "satact": "1560,0",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Physics, World History",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Calculus AB,Caluclus BC,Physics 1: Algebra-Based,Physics C: Electricity & Magnetism,World History",
        "role": "Tutor"
    },
    {
        "name": "Gabrielle Amar",
        "about": "Gabrielle is a senior Biochemistry and Premedical student at Columbia University. She is a member of Columbia’s Peer Health Exchange Chapter, which aims to empower young students to make informed decisions about their health. Gabrielle spent her summers throughout college conducting biology research and hopes to conduct research at a biotech company before attending medical school. Outside of her academic interests, Gabrielle loves drawing and spending time with friends in Central Park.##Gabrielle loves helping other people and sharing her love for fascinating scientific concepts. Solving problems with others is part of her daily routine as she deeply values learning about how other people think and how they can grow their skill set.",
        "satact": "1560,0",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus",
        "school": "Columbia",
        "location": "New York",
        "ap5": "Calculus BC",
        "role": "Tutor"
    },
    {
        "name": "Hyuk Lee",
        "about": "Hyuk is a Mechanical Engineering major at Georgia Tech and is currently pursuing a robotics concentration along with a Computer Science minor. Originally from Cumming, Georgia, he graduated from Lambert High School where he was the president of the robotics club and officer of the Beta club. In his spare time, he enjoys playing baseball as well as working on robots in the lab.##Hyuk has tutored high school students in both the SAT and academic classes for the past two years. He has taught in a variety of settings, both small groups and individual sessions, and he loves seeing students achieve their goals.",
        "satact": "1560,0",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Computer Science, Physics",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Calculus AB,Caluclus BC,Computer Science Principles,Human Geography",
        "role": "Tutor"
    },
    {
        "name": "Irene Ju",
        "about": "Originally from Boston, Irene is a Classics and linguistics major at Harvard University. When she isn’t developing curricula and mentoring students, you can find her planning fun events for the Asian American Association, playing flute for the Harmony mentoring program, and researching for a Classics professor. She’s also the vice-president of the Harvard Undergraduate Studies in Education and works with the Paideia Institute, a non-profit educational organization that aims to preserve the study of Classics.##Irene loves working with students from diverse backgrounds and is passionate about bonding with them. She also loves working on creative writing with her students and learning from their endless creativity and passions. In the future, she aspires to pursue education and become a professor.",
        "satact": "1550,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Latin, World History",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Calculus AB,Latin,World History",
        "role": "Tutor"
    },
    {
        "name": "Isaac Alexander Gershberg",
        "about": "Isaac is a senior at Columbia University majoring in economics and concentrating in statistics. Throughout his undergraduate years, he has worked as a residential advisor, interned with the Council on Foreign Relations, and perfected his sandwich order at the nearest off-campus deli. Originally from Chicago, Isaac likes exploring New York, finding new books to read based on Goodreads reviews alone, and going on runs with friends.##Isaac enjoyed tutoring classmates in high school as a National Honor Society member and continues to mentor students as an undergraduate student.",
        "satact": "1520,33",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Statistics, Biology, English Lang, English Lit, Art, US History, Economics",
        "school": "Columbia",
        "location": "New York",
        "ap5": "Biology,Calculus AB,English Language and Composition,Psychology,Studio Art: 2-D Design,US History",
        "role": "Tutor"
    },
    {
        "name": "Jacob Brachey",
        "about": "Jacob is currently a 2nd-year student at Columbia University where he is studying Economics and Computer Science. He is also a member of the Columbia Heavyweight Rowing program.##Jacob found his passion for tutoring in high school where he created a tutoring system to ensure academic success for his dorm. His favorite part of tutoring is seeing students’ breakthroughs when discovering how to solve a problem. In his free time, Jacob enjoys traveling and everything outdoors.",
        "satact": "1560,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Statistics, Computer Science, Biology, Physics, World History, Economics",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Calculus AB,Calculus BC,Biology,Physics C: Electricity & Magnetism,World History,Macroeconomics,Microeconomics",
        "role": "Tutor"
    },
    {
        "name": "Jacob Paige",
        "about": "Jacob is currently a 2nd-year student at Columbia University where he is studying Economics and Computer Science. He is also a member of the Columbia Heavyweight Rowing program.##Jacob found his passion for tutoring in high school where he created a tutoring system to ensure academic success for his dorm. His favorite part of tutoring is seeing students� breakthroughs when discovering how to solve a problem. In his free time, Jacob enjoys traveling and everything outdoors.",
        "satact": "1550,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Statistics, Economics, US History",
        "school": "Columbia",
        "location": "New York",
        "ap5": "Environmental Science,US History",
        "role": "Tutor"
    },
    {
        "name": "Janet Liu",
        "about": "Janet is a 2nd year Computer Science major at Harvard University. Outside of school and research, she loves to climb, be outdoors, and listen to music.##Janet has been a teaching fellow for 3 different computer science courses at Harvard, 2 at the undergraduate level and 1 at the Harvard Business School. She has also been a teaching assistant in a physics course at high school, and loves working with students of all ages!",
        "satact": "1540,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Biology, Chemistry, Computer Science, English Lit, English Lang, Economics, Statistics",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Biology,Calculus AB,Caluclus BC,Chemistry,English Literature and Composition,Microeconomics,Physics 1: Algebra-Based,Statistics",
        "role": "Tutor"
    },
    {
        "name": "Jerry Han",
        "about": "Jerry is a Computer Science and Business Analytics double major at MIT. Professionally, he is passionate about the field of quantitative finance and applying statistical techniques to make markets more efficient.##Jerry has instructed courses in machine learning for undergraduates at MIT as well as outside for high school students. As a tutor, he has worked with undergraduates of varying levels in computer science, math and physics, as well as high school students for the SAT. Jerry enjoys the process of teaching and witnessing his students grasp previously unfamiliar topics. He always strives to communicate complex concepts clearly in an easily understandable way. When he is not singing with his on-campus a cappella group or hosting his own radio show, Jerry enjoys playing the violin and enjoying history and geopolitics discussions with his quiz bowl teammates.",
        "satact": "1600,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Chinese, Computer Science, English Lit, English Lang, French, Economics, Physics",
        "school": "MIT",
        "location": "Boston",
        "ap5": "Calculus BC,Chinese Language & Culture,Computer Science A,English Literature and Composition,French Language & Culture,Macroeconomics,Microeconomics,Physics C: Electricity & Magnetism",
        "role": "Tutor"
    },
    {
        "name": "Jessica Moore",
        "about": "Jessica is a fourth year Neuroscience and English Literature double major at Harvard University. When she isn’t in her neuroimaging lab developing educational interventions for students with learning disabilities, you can find her writing away for groups like the Harvard Science Review and Let’s Go Travel Guides. On campus, she is the President of the Hasty Pudding Theatricals, America’s oldest theater troupe, and the Leadership Institute, a leadership development non-profit that works with high school students in Boston and around the globe. She is planning to attend law school after she graduates this May, and was recently named a Dennis Washington Leadership Graduate Scholar!##Jessica loves working with students from diverse backgrounds and across all levels of ability. She enjoys wrangling essays into shape, and creating future math wizards! Jessica tutors across a wide variety of subjects from Humanities to STEM, as well as test prep, from the ACT to the SAT, and even AP Exams. She is certified through HealthStream to teach students with learning differences, specializing in dyslexia and dyscalculia. Beyond helping students grow academically, she cherishes the opportunity to build meaningful, positive relationships with her tutees. Jessica also has a very cute Pug named Georgia who loves to join in on her virtual sessions!",
        "satact": "0,34",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Statistics, World History, English Lang, English Lit, US History, World History, Economics, Biology",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "World History,Statistics,English Literature and Composition,English Language and Composition,Human Geography,U.S. History,Macroeconomics,Microeconomics,Calculus AB,Biology",
        "role": "Tutor"
    },

    {
        "name": "Josh Hammonds",
        "about": "Josh is a 4th year Mechanical Engineering student at Georgia Tech and a member of the Air Force Reserve Officer Training Corps. After graduating, Josh hopes to receive a commission as an officer and to work as a developmental engineer in the Air Force. Josh has extensive experience tutoring, having worked with high schoolers of all ages on math and science, as well as the SAT.##Joshua enjoys being a mentor to his students and cadets alike, helping them to pursue excellence. He is also passionate about cooking and soccer!",
        "satact": "0,32",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Physics",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Julia Oladipo",
        "about": "Julia studies Neuroscience and Anthropology at Yale University. In high school, Julia was an avid musician, playing the bassoon, piano, saxophone, oboe, and flute. Julia also conducted medical research by studying the biological mechanisms behind certain forms of cancer. At Yale, Julia is involved in both STEM & Health Equity Advocates as well as the Yale International Relations Association, where she serves as a vice chair for the Yale Model United Nations conference.##Prior to joining Alexander Academy, Julia tutored students through a non-profit organization as well as an after school mentorship program at her high school. She loves helping students develop strategies to overcome standardized testing and make strides toward their academic success!",
        "satact": "1510,35",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Statistics, Biology, Chemistry, US History",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "Calculus BC,US History",
        "role": "Tutor"
    },
    {
        "name": "Julianna Snoeblen",
        "about": "Julianna Snoeblen is a 4th year civil engineering major at Georgia Tech. Julianna is a member of For the Kids, a philanthropic organization, and the NROTC program. She is aspiring to commission as an officer in the United States Navy after graduating. In her free time, she likes to play guitar and read.##Julianna has been a private tutor for a variety of subjects over several years and loves teaching anything STEM related. In the more recent years, she has been specializing in tutoring high school students in the ACT and SAT. She has also worked with younger children as a swim coach in high school.",
        "satact": "1500,33",
        "subjects": "Geometry, Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Physics",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Julien Mermelstein",
        "about": "Julien is a Junior at Duke studying Global Health, Political Science and Economics. Julien is originally from New York, but currently resides in San Francisco. He is amember of the Alpha Delta Phi fraternity, as well as the UNICEF club and club tennis team at Duke.##Julien has tutored students in a range of subjects including math, English, French, and chemistry and loves working with students to help them learn and improve their scores. In his free time, Julien enjoys reading, travelling, scuba diving and watching and playing tennis.",
        "satact": "0,35",
        "subjects": "Economics, English Lang, English Lit, French, US History, World History",
        "school": "Duke",
        "location": "Durham",
        "ap5": "English Literature and Composition,French Language & Culture,US History,World History",
        "role": "Tutor"
    },
    {
        "name": "Julius Ewungkem Jr.",
        "about": "Julius is a Neuroscience major at Harvard University. Originally from Bethlehem, Pennsylvania, he is interested in public health, public policy, and the intersections of these two studies. He is an editor on Harvard's student newspaper as well as a part of Harvard's Public Policy Program and the Harvard Votes Challenge initiative.##Julius has been tutoring students for as long he can remember. Growing up, he was constantly helping his younger relatives with math and science, and this trend continued into high school and now college, where he frequently takes on SAT students. He heavily encourages creativity in all problem solving, and is extremely excited to work with all of the bright students.",
        "satact": "1540,34",
        "subjects": "Biology, English Lang, French, English Lit",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "English Language and Composition,French Language & Composition",
        "role": "Tutor"
    },

    {
        "name": "Karishma Pradhan",
        "about": "Karishma is an 3rd year Industrial Engineering student at Georgia Tech. Originally from Atlanta, GA, she graduated from Pace Academy cum laud. She is a recipient of the Zell Miller Scholarship and Women in Engineering Scholarship and holds a 4.0 GPA.##Karishma is a member of a collegiate, all-women’s, competitive dance team, and has a great passion for dancing, drawing and acting. For the past two summers, Karishma has worked as an assistant teacher at the Goddard preschool. Her love for children and teaching has further led to teach at Alexander Academy. She looks forward to working with all of the bright, motivated students she has the honor of tutoring.",
        "satact": "1530,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Laine Garber",
        "about": "Laine is a third year student at Yale studying Molecular, Cellular and Developmental Biology and History of Science, Public Health and Medicine. She is passionate about creating more equitable health systems in the United States and globally, and took this past semester off to work with different activist organizations to try to further understand and combat health inequity caused by the American criminal justice system. At Yale, she conducts research in an infectious disease lab, and specifically focuses on understanding Malaria and its transmission mechanism. Outside of her studies, Laine is a member of the varsity field hockey team and is passionate about athletics and the outdoors; she loves hiking, skiing, camping and running.##Laine loves working with students of all ages and from various backgrounds, having experience both as a tutor and a coach. She is equipped to help students with everything from math to writing, and has experience in SAT and ACT tutoring, as well as with essay-writing. She looks forward to getting to know her students and hopefully making a lasting impact on their lives!",
        "satact": "1570,34",
        "subjects": "Biology, Chemistry",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Marc Leroux-Parra",
        "about": "Marc is a rising senior at Harvard College studying studio film in the Art, Film, and Visual Studies department with a secondary (minor) in Government. He was a senior staff editor at the Harvard International Review, and is an intern for DRCLAS’ ReVista.##Marc has been a tutor for the past three years across a number of different organizations. He believes that teaching is best done by getting to know each student and tailoring the experience to best suit their needs. Marc specializes in writing-based tutoring, focusing on English writing and grammar, college applications and essays, and any subject which requires essays and/or other types of longform writing. Marc is also bilingual, being a native Spanish speaker, and tutors Spanish as well.",
        "satact": "1410,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, English Lang, English Lit, Spanish, US History, College Application",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Calculus AB,Comparative Government & Politics,English Language and Composition,Environmental Science,Spanish Language & Culture,US History",
        "role": "Tutor"
    },
    {
        "name": "Megan Knauer",
        "about": "Megan is currently a junior at Duke University pursuing a self-designed major called Medical Utilitarianism. She is a coxswain on the women’s varsity rowing team as well as a Margolis Scholar. She also serves as a middle school mentor in the Durham community and is happiest when working with others. She intends to pursue a master’s degree in public health and attend medical school.##Megan loves tutoring and teaching. She is currently piloting an undergraduate half credit class at Duke on the causes and consequences of stress. She began tutoring during her sophomore year of high school when helping K-12 students advance their math skills. She loves helping students develop flexibility in their problem-solving strategies.",
        "satact": "0,36",
        "subjects": "Biology, Algebra I, Algebra II, Pre-Calc, Calculus, Chemistry, English Lang, English Lit, Statistics, US History",
        "school": "Duke",
        "location": "Durham",
        "ap5": "Biology,Calculus AB,Chemistry,English Language and Composition,English Literature and Composition,Statistics,U.S. Government and Politics,U.S. History",
        "role": "Tutor"
    },
    {
        "name": "Michael Medaugh",
        "about": "Michael is a Masters Student studying Bioengineering and Neuroscience at Harvard University. He currently works at Massachusetts General Hospital in the Orthopedics Department, and has also volunteered in medical clinics abroad. In high school, Michael was invited to speak at the US Dept. of State, was a State AP Scholar, and received several national level accolades for competitive mathematics, biology, and neuroscience. He is a National Elks Most Valuable Student Scholar, John Harvard Scholar, Horatio Alger National Scholar, and National Merit Scholar. When able, Michael enjoys rowing, chess, and breeding guppies.##Michael has tutored STEM for Kindergarten through PhD students, taught high school mathematics for the past 3 years, and is deeply passionate about helping driven students create exceptional educational programs. Highlights in Michael’s tutoring career include: accelerating a 3rd grader through precalculus and physics, helping two students under the age of 10 receive over a 700 on the Math section of the SAT, and training a perfect scorer on the American Mathematics Competition.",
        "satact": "2370/1590",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Biology, Chemistry, Computer Science, English Lang, English Lit, European History, Economics, Physics, Statistics",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Biology,Calculus AB,Caluclus BC,Chemistry,Comparative Government & Politics,Computer Science A,English Language and Composition,English Literature and Composition,Environmental Science,European History,Human Geography,Microeconomics,Macroeconomics,Physics 1: Algebra-Based,Psychology,Statistics,US Government & Politics",
        "role": "Tutor"
    },
    {
        "name": "Nadine Khoury",
        "about": "Nadine Marie Khoury, born and raised in Brooklyn, NY, is a recent graduate of Harvard University, where she studied Biomedical Engineering with a minor in Government. In college, she conducted computational genomics research at the Broad Institute of MIT and Harvard, specifically studying the Ebola Virus. She has also conducted research at the Rockefeller University Laboratory of Genetics in New York City, and Brown University’s BrainGate Lab.##Outside the world of science, Nadine served as Harvard’s Student Body Treasurer, was a member of the Institute of Politics, and has enjoyed debate through her middle school, high school, and college teams. She has studied Arabic, Mandarin, French, and Latin, and was a 2015 Yale Young Global Scholar in Science, Policy, and Innovation. In her free time, Nadine enjoys listening to, playing, and composing music. She relishes in the time she spends at the keyboard and hopes to continue nourishing her creative mind during graduate school and beyond.",
        "satact": "2330,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Biology",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Noa Kligfield",
        "about": "Noa is a sophomore Computer Science and Government double major at Harvard College, where she is also involved in model congress, Women in Computer Science, and Jewish life on campus. She also works as a Teaching Fellow in the Introduction to Computer Science course (CS50). Originally from Los Angeles, Noa hopes to focus her career on tech policy, working to ensure that technology is ethical and accessible.##Noa has loved the magical feeling of helping a student finally get something to click since helping her friends in elementary school. She is a believer that any student is capable of mastering a topic if they are taught with patience and empathy. She helps demystify the SAT for her students, breaking down challenging concepts into bite-sized, manageable pieces. Noa hopes to meet you and help you unlock your academic potential!",
        "satact": "1580,0",
        "subjects": "Computer Science, Linear Algebra, Algebra I, Algebra II",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Noga Hurwitz",
        "about": "Noga is pursuing a dual-bachelors degree in Information Science and Philosophy at Columbia University. When she isn’t out exploring New York City, Noga is involved as a board member of the Columbia Organization of Rising Entrepreneurs and plays on the women’s ultimate frisbee team.##In high school, Noga loved working with kids in the community to approach challenging subjects in fun and exciting ways. In college, Noga continues to peer-tutor her friends in computer science and English. She deeply believes that learning should not be stressful, and enjoys finding creative ways to problem-solve.",
        "satact": "1400,0",
        "subjects": "College Application",
        "school": "Columbia",
        "location": "New York",
        "ap5": "Environmental Science",
        "role": "Tutor"
    },
    {
        "name": "Olivia McAuliffe",
        "about": "Olivia graduated recently from Duke University, where she studied Public Policy and Economics and she was a member of the Duke Business Society and TAMID Group at Duke on campus. Olivia is passionate about finding innovative ways to serve underprivileged members of her community. She plans to work on Capitol Hill and ultimately pursue a law degree.##As the youngest child in her family, Olivia never had the chance to help a younger sibling with schoolwork or college applications. To compensate for that, she began tutoring younger students in high school through chemistry and math clubs. She loved learning and growing with students and she continued tutoring during her college career. Olivia participated in the CovEducation program to tutor virtually a student across the country during the COVID-19 pandemic and she tutored students in her neighborhood who were struggling to adapt to online school. Olivia was the recipient of an amazing public K-12 education and she is determined to pass along the privilege of educational access to other students.",
        "satact": "0,35",
        "subjects": "Economics, Algebra I, Algebra II, Pre-Calc, Calculus, English Lang, English Lit, US History, World History, College Application",
        "school": "Duke",
        "location": "Durham",
        "ap5": "Calculus BC,English Language and Composition,English Literature and Composition,US Government and Politics,US History,World History",
        "role": "Tutor"
    },
    {
        "name": "Portia Gaitskell",
        "about": "Portia is currently an undergraduate student at MIT, majoring in Electrical Engineering and Computer Science. She is a member of the Society of Women Engineers, on the board of the MIT Global Research and Consulting Group, and on the Women’s Openweight Crew team. She is also a researcher at the Computer Science and Artificial Intelligence Laboratory, working on techniques for automatic document processing of financial documents.##Portia has been tutoring friends and classmates in a variety of STEM subjects since the beginning of high school. She loves making math and science accessible to students of all backgrounds and making challenging topics easy to understand.",
        "satact": "1580,35",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Chemistry, Computer Science, French, Physics, US History",
        "school": "MIT",
        "location": "Boston",
        "ap5": "Calculus AB,Calculus BC,Chemistry,Computer Science A,French Language & Culture,Physics C: Electricity & Magnetism,U.S. History",
        "role": "Tutor"
    },
    {
        "name": "Regina De Nigris",
        "about": "Regina is a 3rd year Ethics, Politics, and Economics major at Yale University. She is a member of Yale's Latinx Business and Leadership Club, which aims to empower Yale's Latino students to take on leadership roles in their fields of interest. Regina intends to pursue a law degree after graduating from Yale.##Regina started tutoring in high school when she started a program that set up high-achieving high school students with middle schoolers in need of tutoring. Since completing her own college application process, she has loved helping students through theirs, especially when it comes to counseling students as they write their college essays. She also enjoys teaching English, History, and Spanish. Her favorite part of tutoring is seeing her students grow in their own unique ways and being able to help them achieve their goals.",
        "satact": "0,34",
        "subjects": "Economics, Algebra I, Algebra II, Pre-Calc, Calculus, English Lang, English Lit, Spanish, US History, College Application",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "Calculus AB,English Literature and Composition,Spanish Language & Culture,U.S. History",
        "role": "Tutor"
    },
    {
        "name": "Rocio Eiriz",
        "about": "Rocio is a junior studying Economics at Harvard. Originally from Buenos Aires, Argentina, she serves on the executive board of the Harvard Organization for Latin America. On campus, she is actively involved in the Women in Business association and several educational conferences.##Rocio has been tutoring students on the SAT and college admissions since going through the application process herself. She enjoys helping students to build their test-taking skills and confidence, and achieve their goals.",
        "satact": "1570,0",
        "subjects": "Economics, College Application",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "",
        "role": "Tutor"
    },
    {
        "name": "Roopsha D Bandopadhyay",
        "about": "Roopsha studied biological engineering at MIT and is currently doing research on protein modification and drug delivery. While at MIT, she wrote for the Undergraduate Research Journal and MIT Chroma, a science and humanities magazine, and helped to teach courses through MIT’s Educational Studies Program. In her free time, she enjoys hiking, listening to music, and growing aloe plants.##Roopsha ran the science tutoring program in her high school and has loved tutoring ever since. She has worked with a variety of students and subjects, including teaching math to middle school girls, thermodynamics to college students, and SAT writing to high schoolers. She particularly enjoys helping students develop versatile problem-solving and critical thinking skills that can be used in standardized tests, coursework, and beyond.",
        "satact": "0,36",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Biology, English Lang, English Lit, Physics, Spanish, US History",
        "school": "MIT",
        "location": "Boston",
        "ap5": "Biology,Calculus BC,English Literature and Composition,Environmental Science,Music Theory,Physics 2: Algebra-Based,Physics C: Electricity & Magnetism,Spanish Language & Culture,Spanish Literature & Culture,US History",
        "role": "Tutor"
    },
    {
        "name": "Samantha Owusu-Antwi",
        "about": "Samantha is a neuroscience major on the pre-health track at Duke University. She scored a 1580 on the SAT on her first attempt, and she is excited about helping Alexander Academy students achieve their goals.##Samantha has been tutoring students in math since high school and also tutored students in literacy during her first year at Duke. She enjoys music, reading, travelling, and programming machine learning models in her spare time.",
        "satact": "1580,33",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Chemistry, Biology, Statistics, English Lang, English Lit, US History, College Application",
        "school": "Duke",
        "location": "Durham",
        "ap5": "Calculus AB,Calculus BC,Chemistry,Biology,Statistics,English Literature and Composition,English Language and Composition,U.S. History,Comparative Government and Polotics,Human Geography",
        "role": "Tutor"
    },
    {
        "name": "Sarah Mann",
        "about": "Sarah is a third-year student at Harvard College studying History. On campus, she is a member of the Hasty Pudding Theatricals Business Staff and the Women in Business Club. Outside of school, Sarah loves to travel, cook, and play volleyball.##Sarah has worked as a tutor and teaching assistant in a variety of subjects. She loves finding creative ways to help students understand material and think critically. She also loves working closely with students and getting to know their learning preferences, so she can personalize the process and ensure it’s fun and engaging!",
        "satact": "0,35",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, US History",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Calculus BC,US History",
        "role": "Tutor"
    },
    {
        "name": "Siddarth Seemakurti",
        "about": "Sid is a 4th year Chemical Engineering major. He is an undergraduate researcher in the Systems Design Lab on campus, and published a paper for the first time this year in the Chemistry of Materials journal.##Sid has worked with students across all parts of the score range, and loves seeing students reach their potential. Sid tutors in a volunteering role as well with the Keeping Pace program and is passionate about seeing students from all backgrounds get access to quality tutoring.",
        "satact": "0,35",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, Statistics, Biology, Physics, Chemistry",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Statistics,Biology,Physics 1: Algebra-Based",
        "role": "Tutor"
    },
    {
        "name": "Sindhura Siddapureddy",
        "about": "Sindhura is currently an undergraduate student at Yale University, majoring in Molecular Biophysics and Biochemistry. On campus, she researches at the Yale School of Medicine, is a part of the Yale Danceworks team and Yale Powerlifting, and is a Legislative Captain for the Yale Democrats. Beyond that, she is an Associate Editor and writer for The Politic, Yale’s undergraduate journal of politics and culture, and loves all things related to traveling, being outdoors, food, and animals.##Sindhura was a peer tutor for five years throughout high school, and she remains passionate about teaching and mentoring students. For the past two years, Sindhura has had a significant role as both a mentor and Yale’s Campus Manager for Project Access, a nonprofit that supports underprivileged students throughout the college applications process.",
        "satact": "1540,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Chemistry, English Lang, English Lit, European History, Economics, US History",
        "school": "Yale",
        "location": "New Haven",
        "ap5": "Calculus AB,Calculus BC,Chemistry,English Language and Composition,European History,Macroeconomics,Psychology,US History",
        "role": "Tutor"
    },
    {
        "name": "Siofra Murdoch",
        "about": "Siofra Murdoch is a rising junior at Harvard college pursuing a joint degree (double major) in Biomedical Engineering and Neuroscience with a secondary (minor) in Global Health and Health Policy. She intends to pursue a medical degree after graduating from Harvard. Outside of academics, Siofra is a member of the varsity field hockey team. She is also a board member on the SAAC, the Vice President of the uWHA, and an editorial staff writer for The Harvard Crimson.##Siofra first began tutoring in highschool, though has been coaching field hockey since she was 14. She brings the same energy to coaching goal scoring as teaching calculus and hopes that everyone of her students will love learning as much as she does (or at least not hate calculus)!",
        "satact": "0,34",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Biology",
        "school": "Harvard",
        "location": "Boston",
        "ap5": "Biology,Calculus AB",
        "role": "Tutor"
    },
    {
        "name": "Tyler Bolo",
        "about": "Tyler is a 4th year Mechanical Engineering Major at Georgia Tech. Originally from Charlotte, he enjoys playing guitar and doing improv in his free time. He is a member of Delta Sigma Phi fraternity and strives to improve his leadership abilities whenever he gets the chance. After graduating, he hopes to attain his Master�s degree in Mechanical Engineering and pursue a career in the manufacturing industry.###Tyler has been passionate about education from a young age and likes to explore high-level math concepts recreationally. He has been tutoring for several years in many different areas, including SAT, ACT, academic tutoring, guitar, and music theory.",
        "satact": "1560,0",
        "subjects": "Algebra I, Algebra II, Pre-Calc, Calculus, Linear Algebra, US History, Statistics, Economics, Physics",
        "school": "Georgia Tech",
        "location": "Atlanta",
        "ap5": "Calculus AB,Calculus BC,U.S. History,Statistics,Physics 1: Algebra-Based,Physics 2: Algebra-Based,Macroeconomics,Microeconomics",
        "role": "Tutor"
    }
]